Белгипрозем_2017/src/InformationRegisters/НастройкиДоступностиДляВидовДокументов/НастройкиДоступностиДляВидовДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиДоступностиДляВидовДокументов</name>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДоступностиПоСостоянию</name>
    <type>
      <types>CatalogRef.НастройкиДоступностиПоСостоянию</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектов</name>
  <enumValues>
    <name>ВнутренниеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ВходящиеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ИсходящиеДокументы</name>
  </enumValues>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Мероприятия</name>
  </enumValues>
  <enumValues>
    <name>Файлы</name>
  </enumValues>
  <enumValues>
    <name>Проекты</name>
  </enumValues>
  <enumValues>
    <name>ПроектныеЗадачи</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/InformationRegisters/НастройкиДоступностиДляВидовДокументов/Forms/НастройкиПоВидуДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ВидДокумента) Тогда 
		
		Если ТипЗнч(Параметры.ВидДокумента) = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда 
			ТипДокумента = Перечисления.ТипыОбъектов.ВходящиеДокументы;
		ИначеЕсли ТипЗнч(Параметры.ВидДокумента) = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда 
			ТипДокумента = Перечисления.ТипыОбъектов.ИсходящиеДокументы;
		ИначеЕсли ТипЗнч(Параметры.ВидДокумента) = Тип("СправочникСсылка.ВидыВнутреннихДокументов") Тогда 
			ТипДокумента = Перечисления.ТипыОбъектов.ВнутренниеДокументы;
		КонецЕсли;
		
		Список.Параметры.УстановитьЗначениеПараметра("ТипДокумента", ТипДокумента);
		Список.Параметры.УстановитьЗначениеПараметра("ВидДокумента", Параметры.ВидДокумента);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.НастройкаДоступностиПоСостоянию);
	
КонецПроцедуры
